# 2024資網校內淘汰賽試題 - 1026.pka

題目：<a href="Files/2024資網校內淘汰賽試題%20-%201026.pka/1026.pka" download>1026.pka</a>

## Q1 Basic configure

![image](Files/2024資網校內淘汰賽試題%20-%201026.pka/1.png)

你獲得一顆路由器，請嘗試做以下設定：</br>更改主機名稱為 Peace，設定進入特權模式時需要密碼，密碼請設定為 0216，避免下次又再次忘記 console 密碼，請在登入設定 Banner，內容為 console 密碼。

## A1

題目所說明的設定和系統檢測的參數不一致，且 R1 Router 一開始就安照系統參數設定，如更改將會減少完成度，所以不更改。

<img src="Files/2024資網校內淘汰賽試題%20-%201026.pka/2.png" width="58.8%"><img src="Files/2024資網校內淘汰賽試題%20-%201026.pka/3.jpg" width="40%">

第一張為題目系統設定參數，可以發現有些地方跟題目要求不同

| 項目 | 題目要求 | 系統設定參數 |
| --------- | -------- | ---------- |
| Host Name | Peace    | Peace      |
| Password  | 0216     | 0216       |
| Banner    | 0216     | ilvs123456 |

你會發現一開始的 R1 Router就已經完成系統設定參數要求了，如果在更改只會沒分數...

## Q2 VLAN

![image](Files/2024資網校內淘汰賽試題%20-%201026.pka/4.png)

請根據下面清單做設定

| Hostname |   IP Address   |
| -------- |:--------------:|
| Q2-PC1   | 192.168.1.1/24 |
| Q2-PC2   | 192.168.1.2/24 |
| Q2-PC3   | 192.168.1.3/24 |
| Q2-PC4   | 192.168.1.4/24 |

在兩個 Switch 上，建立兩個 VLAN 並分別命名</br>
VLAN 10 : com</br>
VLAN 20 : edu</br>
根據清單，使特定介面僅存取相對應的 VLAN ID Packet</br>
<font color="#f00">(題目有錯誤，下表已修正)</font>

| VLAN ID                        | Device                             | Interface    |
| ------------------------------ |:----------------------------------:|:------------:|
| 10                             | Q2-SW1                             | Fa0/1,Fa0/23 |
| <font color="#f00">20</font> | <font color="#f00">Q2-SW1</font> | Fa0/2,Fa0/24 |
| <font color="#f00">10</font> | <font color="#f00">Q2-SW2</font> | Fa0/3,Fa0/23 |
| 20                             | Q2-SW2                             | Fa0/4,Fa0/24 |

## A2

### Q2-PC1

IP : 192.168.1.1</br>
Mask : 255.255.255.0

### Q2-PC2

IP : 192.168.1.</br>
Mask : 255.255.255.0

### Q2-PC3

IP : 192.168.1.1</br>
Mask : 255.255.255.0

### Q2-PC4

IP : 192.168.1.1</br>
Mask : 255.255.255.0

### Q2-SW1

```Cisco
Switch>en
Switch#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name com
Switch(config-vlan)#interface Fa0/1
Switch(config-if)#switchport access vlan 10
Switch(config-if)#interface Fa0/23
Switch(config-if)#switchport access vlan 10
Switch(config-if)#vlan 20
Switch(config-vlan)#name edu
Switch(config-vlan)#interface Fa0/2
Switch(config-if)#switchport access vlan 20
Switch(config-if)#interface Fa0/24
Switch(config-if)#switchport access vlan 20
```

### Q2-SW2

```Cisco
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#name com
Switch(config-vlan)#interface Fa0/3
Switch(config-if)#switchport access vlan 10
Switch(config-if)#interface Fa0/23
Switch(config-if)#switchport access vlan 10
Switch(config-if)#vlan 20
Switch(config-vlan)#name edu
Switch(config-vlan)#interface Fa0/4
Switch(config-if)#switchport access vlan 20
Switch(config-if)#interface Fa0/24
Switch(config-if)#switchport access vlan 20
```

## Q3 802.1Q

<img src="Files/2024資網校內淘汰賽試題%20-%201026.pka/5.png" width="50%">

請根據下面清單做相對應的設定，其中 Router 上的子介面需使用 802.1Q 做封裝，相對應的 VLAN 與介面請自行判斷，最後兩台 PC 應能與相對應的子介面連線。

| Hostname | Interface |    IP Address    |
| -------- | --------- | ---------------- |
| Q3-R1    | Fa0/0.111 | 192.168.3.1/26   |
| Q3-PC1   | Fa0       | 192.168.3.62/26  |
| Q3-R1    | Fa0/0.222 | 192.168.3.129/26 |
| Q3-PC2   | Fa0       | 192.168.3.190/26 |

## A3

### Q3-PC1

IP : 192.168.3.62</br>
Mask : 255.255.255.192

### Q3-PC2

IP : 192.168.3.190</br>
Mask : 255.255.255.192

### Q3-SW1

```Cisco
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 111
Switch(config-vlan)#vlan 222
Switch(config-vlan)#interface Fa0/1
Switch(config-if)#switchport access vlan 111
Switch(config-if)#interface Fa0/2
Switch(config-if)#switchport access vlan 222
```

### Q3-R1

```Cisco
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface Fa0/0
Router(config-if)#no shutdown
Router(config-if)#interface Fa0/0.111
Router(config-subif)#encapsulation dot1Q 111
Router(config-subif)#ip address 192.168.3.1 255.255.255.192
Router(config-subif)#interface Fa0/0.222
Router(config-subif)#encapsulation dot1Q 222
Router(config-subif)#ip address 192.168.3.129 255.255.255.192
```

## Q4 Dymanic Route

![image](Files/2024資網校內淘汰賽試題%20-%201026.pka/6.png)

請根據下面清單做相對應的設定，並使用 RIPv2 進行動態路由協定，相對應的介面設定請自行思考，最後兩台 PC 應該能互相連線。

| Hostname | Interface   | IP Address       |
| -------- | ----------- | ---------------- |
| Q4-R1    | Se0/0/0     | 172.16.0.1/24    |
| Q4-R1    | Fa0/0       | 10.0.0.254/24    |
| Q4-R2    | Se0/0/0     | 172.16.0.254/24  |
| Q4-R2    | Se0/0/1     | 192.168.0.1/24   |
| Q4-R3    | Se0/0/1     | 192.168.0.254/24 |
| Q4-R3    | Fa0/0       | 168.95.1.254/24  |
| Q4-PC1   | Fa0         | 10.0.0.1/24      |
| Q4-PC2   | Fa0         | 168.95.1.1/24    |

## A4

### Q4-PC1

IP : 10.0.0.1</br>
Mask : 255.255.255.0</br>
Default GateWay : 10.0.0.254(Q4-R1 Fa0/0 IP)

### Q4-PC2

IP : 10.0.0.1</br>
Mask : 255.255.255.0</br>
Default GateWay : 10.0.0.254(Q4-R1 Fa0/0 IP)

### Q4-R1

```Cisco
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface Fa0/0
Router(config-if)#no shutdown
Router(config-if)#ip address 10.0.0.254 255.255.255.0
Router(config-if)#interface Se0/0/0
Router(config-if)#no shutdown
Router(config-if)#ip address 172.16.0.1 255.255.255.0
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#network 10.0.0.0
Router(config-router)#network 172.16.0.0
```

### Q4-R2

```Cisco
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface Se0/0/0
Router(config-if)#no shutdown
Router(config-if)#ip address 172.16.0.254 255.255.255.0
Router(config-if)#interface Se0/0/1
Router(config-if)#no shutdown
Router(config-if)#ip address 192.168.0.1 255.255.255.0
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#network 172.16.0.0
Router(config-router)#network 192.168.0.0
```

### Q4-R3

```Cisco
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface Fa0/0
Router(config-if)#no shutdown
Router(config-if)#ip address 168.95.1.254 255.255.255.0
Router(config-if)#interface Se0/0/1
Router(config-if)#no shutdown
Router(config-if)#ip address 192.168.0.254 255.255.255.0
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#network 168.95.1.0
Router(config-router)#network 192.168.0.0
```
